#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-cost-slack.module.lambda.data.external.built will be read during apply
  # (config refers to values not yet known)
 <= data "external" "built"  {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/aws-cost-slack.lambda/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/372e831090e45b7770900765aa044135f9c7b39c664ab944da21b839f3ddc3b7.zip' 'python3.6' '/terraform/modules/aws-cost-slack/aws-billing-to-slack/handler.py'"
          + "filename_new"   = "builds/372e831090e45b7770900765aa044135f9c7b39c664ab944da21b839f3ddc3b7.zip"
          + "filename_old"   = "builds/372e831090e45b7770900765aa044135f9c7b39c664ab944da21b839f3ddc3b7.zip"
          + "module_relpath" = ".terraform/modules/aws-cost-slack.lambda"
        }
      + result  = (known after apply)
    }

  # module.aws-cost-slack.module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack"
        description                    = "Deployment deploy status task"
      ~ filename                       = ".terraform/modules/aws-cost-slack.lambda/builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip" -> (known after apply)
        function_name                  = "aws-cost-slack"
        handler                        = "handler.report_cost"
        id                             = "aws-cost-slack"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack/invocations"
      ~ last_modified                  = "2020-02-11T11:43:48.877+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-cost-slack"
        runtime                        = "python3.6"
        source_code_hash               = "msTpJkeOQdp0iKyQCHK4pN9PadsAJTCBtXKHQ3uawNQ="
        source_code_size               = 1731
        tags                           = {}
        timeout                        = 300
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-cost-slack.module.lambda.null_resource.archive must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "253844030886898028" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/0d040bcf6acbbfe1745b5264ab9812ec8315d570dea1b5e30fcf48e1a37e073f.zip" -> "builds/372e831090e45b7770900765aa044135f9c7b39c664ab944da21b839f3ddc3b7.zip"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
